Cargando casos de entrenamiento...
Cargando casos de prueba...
Compilando red...
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
aux_input (InputLayer)           (None, 50)            0                                            
____________________________________________________________________________________________________
aux_input2 (InputLayer)          (None, 50)            0                                            
____________________________________________________________________________________________________
main_input (InputLayer)          (None, 50)            0                                            
____________________________________________________________________________________________________
embedding_1 (Embedding)          (None, 50, 5)         500                                          
____________________________________________________________________________________________________
embedding_2 (Embedding)          (None, 50, 5)         500                                          
____________________________________________________________________________________________________
embedding_3 (Embedding)          (None, 50, 150)       8542050                                      
____________________________________________________________________________________________________
concatenate_1 (Concatenate)      (None, 50, 10)        0                                            
____________________________________________________________________________________________________
concatenate_2 (Concatenate)      (None, 50, 160)       0                                            
____________________________________________________________________________________________________
conv1d_1 (Conv1D)                (None, 46, 300)       240300                                       
____________________________________________________________________________________________________
global_max_pooling1d_1 (GlobalMa (None, 300)           0                                            
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 300)           90300                                        
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 300)           0                                            
____________________________________________________________________________________________________
dense_2 (Dense)                  (None, 51)            15351                                        
____________________________________________________________________________________________________
softmax_layer (Activation)       (None, 51)            0                                            
====================================================================================================
Total params: 8,889,001.0
Trainable params: 8,889,001.0
Non-trainable params: 0.0
____________________________________________________________________________________________________
Entrenando...
Train on 365644 samples, validate on 78185 samples
Epoch 1/3
379s - loss: 0.0018 - acc: 0.0000e+00 - val_loss: 0.0016 - val_acc: 0.0000e+00
Epoch 2/3
379s - loss: 0.0018 - acc: 2.7349e-06 - val_loss: 0.0016 - val_acc: 0.0000e+00
Epoch 3/3
379s - loss: 0.0018 - acc: 2.7349e-06 - val_loss: 0.0016 - val_acc: 0.0000e+00
Obteniendo metricas...
