Cantidad de palabras consideradas: 56947
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
main_input (InputLayer)          (None, None)          0                                            
____________________________________________________________________________________________________
embedding_1 (Embedding)          (None, None, 50)      2847350                                      
____________________________________________________________________________________________________
aux_input (InputLayer)           (None, None, 2)       0                                            
____________________________________________________________________________________________________
concatenate_1 (Concatenate)      (None, None, 52)      0                                            
____________________________________________________________________________________________________
conv1d_1 (Conv1D)                (None, None, 300)     78300                                        
____________________________________________________________________________________________________
global_max_pooling1d_1 (GlobalMa (None, 300)           0                                            
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 300)           90300                                        
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 300)           0                                            
____________________________________________________________________________________________________
dense_2 (Dense)                  (None, 33)            9933                                         
____________________________________________________________________________________________________
softmax_layer (Activation)       (None, 33)            0                                            
====================================================================================================
Total params: 3,025,883.0
Trainable params: 3,025,883.0
Non-trainable params: 0.0
____________________________________________________________________________________________________
Cargando casos de entrenamiento...
Cargando casos de prueba...
Entrenando...
Train on 1727336 samples, validate on 368226 samples
Epoch 1/3
535s - loss: 0.9748 - acc: 0.7915 - val_loss: 0.9755 - val_acc: 0.7919
Epoch 2/3
534s - loss: 0.9604 - acc: 0.7916 - val_loss: 0.9638 - val_acc: 0.7930
Epoch 3/3
534s - loss: 0.9565 - acc: 0.7913 - val_loss: 0.9656 - val_acc: 0.7929
