Cantidad de palabras consideradas: 56947
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
main_input (InputLayer)          (None, None)          0                                            
____________________________________________________________________________________________________
embedding_1 (Embedding)          (None, None, 150)     8542050                                      
____________________________________________________________________________________________________
aux_input (InputLayer)           (None, None, 2)       0                                            
____________________________________________________________________________________________________
concatenate_1 (Concatenate)      (None, None, 152)     0                                            
____________________________________________________________________________________________________
conv1d_1 (Conv1D)                (None, None, 300)     228300                                       
____________________________________________________________________________________________________
global_max_pooling1d_1 (GlobalMa (None, 300)           0                                            
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 300)           90300                                        
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 300)           0                                            
____________________________________________________________________________________________________
dense_2 (Dense)                  (None, 33)            9933                                         
____________________________________________________________________________________________________
softmax_layer (Activation)       (None, 33)            0                                            
====================================================================================================
Total params: 8,870,583.0
Trainable params: 8,870,583.0
Non-trainable params: 0.0
____________________________________________________________________________________________________
Cargando casos de entrenamiento...
Cargando casos de prueba...
Entrenando...
Train on 1886665 samples, validate on 399331 samples
Epoch 1/5
9745s - loss: 1.0432 - acc: 0.7915 - val_loss: 1.0366 - val_acc: 0.7926
Epoch 2/5
1723s - loss: 1.0393 - acc: 0.7917 - val_loss: 1.0604 - val_acc: 0.7926
Epoch 3/5
1717s - loss: 1.0389 - acc: 0.7917 - val_loss: 1.0266 - val_acc: 0.7926
Epoch 4/5
1719s - loss: 1.0387 - acc: 0.7917 - val_loss: 1.0347 - val_acc: 0.7926
Epoch 5/5
