Cargando casos de entrenamiento...
Cargando casos de prueba...
Compilando red...
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
aux_input (InputLayer)           (None, 50)            0                                            
____________________________________________________________________________________________________
aux_input2 (InputLayer)          (None, 50)            0                                            
____________________________________________________________________________________________________
main_input (InputLayer)          (None, 50)            0                                            
____________________________________________________________________________________________________
embedding_1 (Embedding)          (None, 50, 5)         500                                          
____________________________________________________________________________________________________
embedding_2 (Embedding)          (None, 50, 5)         500                                          
____________________________________________________________________________________________________
embedding_3 (Embedding)          (None, 50, 50)        2847350                                      
____________________________________________________________________________________________________
concatenate_1 (Concatenate)      (None, 50, 10)        0                                            
____________________________________________________________________________________________________
concatenate_2 (Concatenate)      (None, 50, 60)        0                                            
____________________________________________________________________________________________________
conv1d_1 (Conv1D)                (None, 46, 300)       90300                                        
____________________________________________________________________________________________________
global_max_pooling1d_1 (GlobalMa (None, 300)           0                                            
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 300)           90300                                        
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 300)           0                                            
____________________________________________________________________________________________________
dense_2 (Dense)                  (None, 500)           150500                                       
____________________________________________________________________________________________________
activation_2 (Activation)        (None, 500)           0                                            
____________________________________________________________________________________________________
dense_3 (Dense)                  (None, 17)            8517                                         
____________________________________________________________________________________________________
softmax_layer (Activation)       (None, 17)            0                                            
====================================================================================================
Total params: 3,187,967.0
Trainable params: 3,187,967.0
Non-trainable params: 0.0
____________________________________________________________________________________________________
Entrenando...
Train on 1727336 samples, validate on 368226 samples
Epoch 1/3
832s - loss: 0.3010 - acc: 0.9052 - val_loss: 0.6192 - val_acc: 0.8456
Epoch 2/3
830s - loss: 0.1333 - acc: 0.9567 - val_loss: 0.7388 - val_acc: 0.8435
Epoch 3/3
830s - loss: 0.0944 - acc: 0.9695 - val_loss: 0.8175 - val_acc: 0.8444
Obteniendo metricas...
