Cantidad de palabras consideradas: 56947
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
main_input (InputLayer)          (None, None)          0                                            
____________________________________________________________________________________________________
embedding_1 (Embedding)          (None, None, 150)     8542050                                      
____________________________________________________________________________________________________
aux_input (InputLayer)           (None, None, 1)       0                                            
____________________________________________________________________________________________________
concatenate_1 (Concatenate)      (None, None, 151)     0                                            
____________________________________________________________________________________________________
conv1d_1 (Conv1D)                (None, None, 300)     226800                                       
____________________________________________________________________________________________________
global_max_pooling1d_1 (GlobalMa (None, 300)           0                                            
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 300)           90300                                        
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 300)           0                                            
____________________________________________________________________________________________________
dense_2 (Dense)                  (None, 13)            3913                                         
____________________________________________________________________________________________________
softmax_layer (Activation)       (None, 13)            0                                            
====================================================================================================
Total params: 8,863,063.0
Trainable params: 8,863,063.0
Non-trainable params: 0.0
____________________________________________________________________________________________________
Cargando casos de entrenamiento...
Cargando casos de prueba...
Entrenando...
Train on 365080 samples, validate on 78577 samples
Epoch 1/3
262s - loss: 1.3208 - acc: 0.5104 - val_loss: 1.4972 - val_acc: 0.4536
Epoch 2/3
261s - loss: 1.2431 - acc: 0.5233 - val_loss: 1.4844 - val_acc: 0.4572
Epoch 3/3
261s - loss: 1.2154 - acc: 0.5263 - val_loss: 1.5000 - val_acc: 0.4514
