Cantidad de palabras consideradas: 56947
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
main_input (InputLayer)          (None, None)          0                                            
____________________________________________________________________________________________________
embedding_1 (Embedding)          (None, None, 50)      2847350                                      
____________________________________________________________________________________________________
aux_input (InputLayer)           (None, None, 1)       0                                            
____________________________________________________________________________________________________
concatenate_1 (Concatenate)      (None, None, 51)      0                                            
____________________________________________________________________________________________________
conv1d_1 (Conv1D)                (None, None, 300)     76800                                        
____________________________________________________________________________________________________
global_max_pooling1d_1 (GlobalMa (None, 300)           0                                            
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 300)           90300                                        
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 300)           0                                            
____________________________________________________________________________________________________
dense_2 (Dense)                  (None, 9)             2709                                         
____________________________________________________________________________________________________
softmax_layer (Activation)       (None, 9)             0                                            
====================================================================================================
Total params: 3,017,159.0
Trainable params: 3,017,159.0
Non-trainable params: 0.0
____________________________________________________________________________________________________
Cargando casos de entrenamiento...
Cargando casos de prueba...
Entrenando...
Train on 365080 samples, validate on 78577 samples
Epoch 1/3
112s - loss: 1.1618 - acc: 0.5480 - val_loss: 1.1932 - val_acc: 0.5164
Epoch 2/3
110s - loss: 1.0969 - acc: 0.5686 - val_loss: 1.2139 - val_acc: 0.5090
Epoch 3/3
110s - loss: 1.0779 - acc: 0.5698 - val_loss: 1.2514 - val_acc: 0.4944
