Cargando casos de entrenamiento...
[0 0 0 0 0 0 0 0 1]
Cargando casos de prueba...
[0 0 0 0 1 0 0 0 0]
Compilando red...
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
main_input (InputLayer)          (None, 50)            0                                            
____________________________________________________________________________________________________
aux_input (InputLayer)           (None, 50)            0                                            
____________________________________________________________________________________________________
embedding_2 (Embedding)          (None, 50, 50)        2847350                                      
____________________________________________________________________________________________________
embedding_1 (Embedding)          (None, 50, 5)         500                                          
____________________________________________________________________________________________________
concatenate_1 (Concatenate)      (None, 50, 55)        0                                            
____________________________________________________________________________________________________
conv1d_1 (Conv1D)                (None, 46, 300)       82800                                        
____________________________________________________________________________________________________
global_max_pooling1d_1 (GlobalMa (None, 300)           0                                            
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 300)           90300                                        
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 300)           0                                            
____________________________________________________________________________________________________
dense_2 (Dense)                  (None, 9)             2709                                         
____________________________________________________________________________________________________
softmax_layer (Activation)       (None, 9)             0                                            
====================================================================================================
Total params: 3,023,659.0
Trainable params: 3,023,659.0
Non-trainable params: 0.0
____________________________________________________________________________________________________
Entrenando...
Train on 70484 samples, validate on 78577 samples
Epoch 1/20
44s - loss: 0.3621 - acc: 0.9136 - val_loss: 0.2221 - val_acc: 0.9415
Epoch 2/20
44s - loss: 0.1085 - acc: 0.9677 - val_loss: 0.2473 - val_acc: 0.9377
Epoch 3/20
44s - loss: 0.0342 - acc: 0.9896 - val_loss: 0.3135 - val_acc: 0.9355
Epoch 4/20
44s - loss: 0.0125 - acc: 0.9964 - val_loss: 0.3667 - val_acc: 0.9363
Epoch 5/20
44s - loss: 0.0069 - acc: 0.9979 - val_loss: 0.4311 - val_acc: 0.9321
Obteniendo metricas...
