Cargando casos de entrenamiento...
[0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1]
Cargando casos de prueba...
[1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0]
Compilando red...
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
aux_input (InputLayer)           (None, 50)            0                                            
____________________________________________________________________________________________________
aux_input2 (InputLayer)          (None, 50)            0                                            
____________________________________________________________________________________________________
main_input (InputLayer)          (None, 50)            0                                            
____________________________________________________________________________________________________
embedding_1 (Embedding)          (None, 50, 5)         500                                          
____________________________________________________________________________________________________
embedding_2 (Embedding)          (None, 50, 5)         500                                          
____________________________________________________________________________________________________
embedding_3 (Embedding)          (None, 50, 50)        2847350                                      
____________________________________________________________________________________________________
concatenate_1 (Concatenate)      (None, 50, 10)        0                                            
____________________________________________________________________________________________________
concatenate_2 (Concatenate)      (None, 50, 60)        0                                            
____________________________________________________________________________________________________
conv1d_1 (Conv1D)                (None, 46, 300)       90300                                        
____________________________________________________________________________________________________
global_max_pooling1d_1 (GlobalMa (None, 300)           0                                            
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 300)           90300                                        
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 300)           0                                            
____________________________________________________________________________________________________
dense_2 (Dense)                  (None, 500)           150500                                       
____________________________________________________________________________________________________
activation_2 (Activation)        (None, 500)           0                                            
____________________________________________________________________________________________________
dense_3 (Dense)                  (None, 17)            8517                                         
____________________________________________________________________________________________________
softmax_layer (Activation)       (None, 17)            0                                            
====================================================================================================
Total params: 3,187,967.0
Trainable params: 3,187,967.0
Non-trainable params: 0.0
____________________________________________________________________________________________________
Entrenando...
Train on 79899 samples, validate on 368226 samples
Epoch 1/20
116s - loss: 0.5250 - acc: 0.8532 - val_loss: 0.8325 - val_acc: 0.7811
Epoch 2/20
116s - loss: 0.2047 - acc: 0.9374 - val_loss: 1.0387 - val_acc: 0.7602
Epoch 3/20
116s - loss: 0.1090 - acc: 0.9658 - val_loss: 1.1085 - val_acc: 0.7897
Epoch 4/20
116s - loss: 0.0725 - acc: 0.9766 - val_loss: 1.3735 - val_acc: 0.7959
Epoch 5/20
116s - loss: 0.0497 - acc: 0.9845 - val_loss: 1.4654 - val_acc: 0.8047
Epoch 6/20
116s - loss: 0.0409 - acc: 0.9870 - val_loss: 1.5547 - val_acc: 0.7919
Epoch 7/20
116s - loss: 0.0359 - acc: 0.9883 - val_loss: 1.5606 - val_acc: 0.7863
Epoch 8/20
116s - loss: 0.0328 - acc: 0.9897 - val_loss: 1.6980 - val_acc: 0.7900
Epoch 9/20
116s - loss: 0.0245 - acc: 0.9924 - val_loss: 1.6624 - val_acc: 0.7901
Obteniendo metricas...
