Cargando casos de entrenamiento...
[0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1]
Cargando casos de prueba...
[1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0]
Compilando red...
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
aux_input (InputLayer)           (None, 50)            0                                            
____________________________________________________________________________________________________
aux_input2 (InputLayer)          (None, 50)            0                                            
____________________________________________________________________________________________________
main_input (InputLayer)          (None, 50)            0                                            
____________________________________________________________________________________________________
embedding_1 (Embedding)          (None, 50, 5)         500                                          
____________________________________________________________________________________________________
embedding_2 (Embedding)          (None, 50, 5)         500                                          
____________________________________________________________________________________________________
embedding_3 (Embedding)          (None, 50, 150)       8542050                                      
____________________________________________________________________________________________________
concatenate_1 (Concatenate)      (None, 50, 10)        0                                            
____________________________________________________________________________________________________
concatenate_2 (Concatenate)      (None, 50, 160)       0                                            
____________________________________________________________________________________________________
conv1d_1 (Conv1D)                (None, 46, 300)       240300                                       
____________________________________________________________________________________________________
global_max_pooling1d_1 (GlobalMa (None, 300)           0                                            
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 300)           90300                                        
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 300)           0                                            
____________________________________________________________________________________________________
dense_2 (Dense)                  (None, 500)           150500                                       
____________________________________________________________________________________________________
activation_2 (Activation)        (None, 500)           0                                            
____________________________________________________________________________________________________
dense_3 (Dense)                  (None, 17)            8517                                         
____________________________________________________________________________________________________
softmax_layer (Activation)       (None, 17)            0                                            
====================================================================================================
Total params: 9,032,667.0
Trainable params: 9,032,667.0
Non-trainable params: 0.0
____________________________________________________________________________________________________
Entrenando...
Train on 1727336 samples, validate on 368226 samples
Epoch 1/20
1799s - loss: 0.3812 - acc: 0.8821 - val_loss: 0.5719 - val_acc: 0.8493
Epoch 2/20
1794s - loss: 0.1845 - acc: 0.9406 - val_loss: 0.6398 - val_acc: 0.8473
Epoch 3/20
1794s - loss: 0.1416 - acc: 0.9545 - val_loss: 0.7278 - val_acc: 0.8472
Epoch 4/20
1794s - loss: 0.1215 - acc: 0.9612 - val_loss: 0.7669 - val_acc: 0.8479
Epoch 5/20
1794s - loss: 0.1097 - acc: 0.9648 - val_loss: 0.8202 - val_acc: 0.8473
Obteniendo metricas...
