Cargando casos de entrenamiento...
[0 0 1 0 0 0 0 0 0 0 0 0]
Cargando casos de prueba...
[0 0 0 0 0 1 0 0 0 0 0 0]
Compilando red...
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
main_input (InputLayer)          (None, 50)            0                                            
____________________________________________________________________________________________________
aux_input (InputLayer)           (None, 50)            0                                            
____________________________________________________________________________________________________
embedding_2 (Embedding)          (None, 50, 150)       8542050                                      
____________________________________________________________________________________________________
embedding_1 (Embedding)          (None, 50, 5)         500                                          
____________________________________________________________________________________________________
concatenate_1 (Concatenate)      (None, 50, 155)       0                                            
____________________________________________________________________________________________________
conv1d_1 (Conv1D)                (None, 46, 300)       232800                                       
____________________________________________________________________________________________________
global_max_pooling1d_1 (GlobalMa (None, 300)           0                                            
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 300)           90300                                        
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 300)           0                                            
____________________________________________________________________________________________________
dense_2 (Dense)                  (None, 12)            3612                                         
____________________________________________________________________________________________________
softmax_layer (Activation)       (None, 12)            0                                            
====================================================================================================
Total params: 8,869,262.0
Trainable params: 8,869,262.0
Non-trainable params: 0.0
____________________________________________________________________________________________________
Entrenando...
Train on 365720 samples, validate on 78706 samples
Epoch 1/3
369s - loss: 0.2739 - acc: 0.9060 - val_loss: 0.1263 - val_acc: 0.9576
Epoch 2/3
369s - loss: 0.0864 - acc: 0.9709 - val_loss: 0.1192 - val_acc: 0.9623
Epoch 3/3
369s - loss: 0.0574 - acc: 0.9806 - val_loss: 0.1094 - val_acc: 0.9666
Obteniendo metricas...
