Cargando casos de entrenamiento...
Cargando casos de prueba...
Compilando red...
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
aux_input (InputLayer)           (None, 50)            0                                            
____________________________________________________________________________________________________
aux_input2 (InputLayer)          (None, 50)            0                                            
____________________________________________________________________________________________________
main_input (InputLayer)          (None, 50)            0                                            
____________________________________________________________________________________________________
embedding_1 (Embedding)          (None, 50, 5)         500                                          
____________________________________________________________________________________________________
embedding_2 (Embedding)          (None, 50, 5)         500                                          
____________________________________________________________________________________________________
embedding_3 (Embedding)          (None, 50, 150)       8542050                                      
____________________________________________________________________________________________________
concatenate_1 (Concatenate)      (None, 50, 10)        0                                            
____________________________________________________________________________________________________
concatenate_2 (Concatenate)      (None, 50, 160)       0                                            
____________________________________________________________________________________________________
conv1d_1 (Conv1D)                (None, 46, 300)       240300                                       
____________________________________________________________________________________________________
global_max_pooling1d_1 (GlobalMa (None, 300)           0                                            
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 300)           90300                                        
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 300)           0                                            
____________________________________________________________________________________________________
dense_2 (Dense)                  (None, 500)           150500                                       
____________________________________________________________________________________________________
activation_2 (Activation)        (None, 500)           0                                            
____________________________________________________________________________________________________
dense_3 (Dense)                  (None, 52)            26052                                        
____________________________________________________________________________________________________
softmax_layer (Activation)       (None, 52)            0                                            
====================================================================================================
Total params: 9,050,202.0
Trainable params: 9,050,202.0
Non-trainable params: 0.0
____________________________________________________________________________________________________
Entrenando...
Train on 1727336 samples, validate on 368226 samples
Epoch 1/3
5739s - loss: 2892633.6779 - acc: 0.1806 - val_loss: 3223261.4607 - val_acc: 0.0520
Epoch 2/3
1803s - loss: 2876816.9170 - acc: 0.1910 - val_loss: 3225900.9914 - val_acc: 0.0497
Epoch 3/3
1796s - loss: 2875874.0563 - acc: 0.1910 - val_loss: 3235028.2070 - val_acc: 0.0478
Obteniendo metricas...
