Cargando casos de entrenamiento...
Cargando casos de prueba...
Compilando red...
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
aux_input (InputLayer)           (None, 50)            0                                            
____________________________________________________________________________________________________
aux_input2 (InputLayer)          (None, 50)            0                                            
____________________________________________________________________________________________________
main_input (InputLayer)          (None, 50)            0                                            
____________________________________________________________________________________________________
embedding_1 (Embedding)          (None, 50, 5)         500                                          
____________________________________________________________________________________________________
embedding_2 (Embedding)          (None, 50, 5)         500                                          
____________________________________________________________________________________________________
embedding_3 (Embedding)          (None, 50, 50)        2847350                                      
____________________________________________________________________________________________________
concatenate_1 (Concatenate)      (None, 50, 10)        0                                            
____________________________________________________________________________________________________
concatenate_2 (Concatenate)      (None, 50, 60)        0                                            
____________________________________________________________________________________________________
conv1d_1 (Conv1D)                (None, 46, 300)       90300                                        
____________________________________________________________________________________________________
global_max_pooling1d_1 (GlobalMa (None, 300)           0                                            
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 300)           90300                                        
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 300)           0                                            
____________________________________________________________________________________________________
dense_2 (Dense)                  (None, 51)            15351                                        
____________________________________________________________________________________________________
softmax_layer (Activation)       (None, 51)            0                                            
====================================================================================================
Total params: 3,044,301.0
Trainable params: 3,044,301.0
Non-trainable params: 0.0
____________________________________________________________________________________________________
Entrenando...
Train on 187097 samples, validate on 40979 samples
Epoch 1/3
90s - loss: 9.6146e-04 - acc: 0.0032 - val_loss: 0.0011 - val_acc: 0.0000e+00
Epoch 2/3
89s - loss: 9.0279e-04 - acc: 0.0385 - val_loss: 0.0012 - val_acc: 0.0000e+00
Epoch 3/3
89s - loss: 8.5058e-04 - acc: 0.0175 - val_loss: 0.0012 - val_acc: 1.9522e-04
Obteniendo metricas...
