Cantidad de palabras consideradas: 56947
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
main_input (InputLayer)          (None, None)          0                                            
____________________________________________________________________________________________________
embedding_1 (Embedding)          (None, None, 150)     8542050                                      
____________________________________________________________________________________________________
aux_input (InputLayer)           (None, None, 1)       0                                            
____________________________________________________________________________________________________
concatenate_1 (Concatenate)      (None, None, 151)     0                                            
____________________________________________________________________________________________________
conv1d_1 (Conv1D)                (None, None, 300)     226800                                       
____________________________________________________________________________________________________
global_max_pooling1d_1 (GlobalMa (None, 300)           0                                            
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 300)           90300                                        
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 300)           0                                            
____________________________________________________________________________________________________
dense_2 (Dense)                  (None, 17)            5117                                         
____________________________________________________________________________________________________
softmax_layer (Activation)       (None, 17)            0                                            
====================================================================================================
Total params: 8,864,267.0
Trainable params: 8,864,267.0
Non-trainable params: 0.0
____________________________________________________________________________________________________
Cargando casos de entrenamiento...
Cargando casos de prueba...
Entrenando...
Train on 382982 samples, validate on 82232 samples
Epoch 1/5
345s - loss: 0.5215 - acc: 0.9134 - val_loss: 0.5338 - val_acc: 0.9109
Epoch 2/5
344s - loss: 0.5150 - acc: 0.9143 - val_loss: 0.5303 - val_acc: 0.9109
Epoch 3/5
344s - loss: 0.5145 - acc: 0.9143 - val_loss: 0.5310 - val_acc: 0.9109
Epoch 4/5
344s - loss: 0.5139 - acc: 0.9146 - val_loss: 0.5312 - val_acc: 0.9109
Epoch 5/5
343s - loss: 0.5141 - acc: 0.9143 - val_loss: 0.5319 - val_acc: 0.9109
