Cargando casos de entrenamiento...
[0 0 0 0 0 0 0 0 0 0 1]
Cargando casos de prueba...
[1 0 0 0 0 0 0 0 0 0 0]
Compilando red...
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
main_input (InputLayer)          (None, 50)            0                                            
____________________________________________________________________________________________________
aux_input (InputLayer)           (None, 50)            0                                            
____________________________________________________________________________________________________
embedding_2 (Embedding)          (None, 50, 150)       8542050                                      
____________________________________________________________________________________________________
embedding_1 (Embedding)          (None, 50, 5)         500                                          
____________________________________________________________________________________________________
concatenate_1 (Concatenate)      (None, 50, 155)       0                                            
____________________________________________________________________________________________________
conv1d_1 (Conv1D)                (None, 46, 300)       232800                                       
____________________________________________________________________________________________________
global_max_pooling1d_1 (GlobalMa (None, 300)           0                                            
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 300)           90300                                        
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 300)           0                                            
____________________________________________________________________________________________________
dense_2 (Dense)                  (None, 11)            3311                                         
____________________________________________________________________________________________________
softmax_layer (Activation)       (None, 11)            0                                            
====================================================================================================
Total params: 8,868,961.0
Trainable params: 8,868,961.0
Non-trainable params: 0.0
____________________________________________________________________________________________________
Entrenando...
Train on 364880 samples, validate on 78535 samples
Epoch 1/3
366s - loss: 0.5393 - acc: 0.8196 - val_loss: 0.3788 - val_acc: 0.8694
Epoch 2/3
366s - loss: 0.2526 - acc: 0.9119 - val_loss: 0.3707 - val_acc: 0.8774
Epoch 3/3
365s - loss: 0.1621 - acc: 0.9439 - val_loss: 0.4211 - val_acc: 0.8734
Obteniendo metricas...
