Cargando casos de entrenamiento...
[1 0 0 0 0 0 0 0 0 0 0]
Cargando casos de prueba...
[1 0 0 0 0 0 0 0 0 0 0]
Compilando red...
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
main_input (InputLayer)          (None, 50)            0                                            
____________________________________________________________________________________________________
aux_input (InputLayer)           (None, 50)            0                                            
____________________________________________________________________________________________________
embedding_2 (Embedding)          (None, 50, 50)        2847350                                      
____________________________________________________________________________________________________
embedding_1 (Embedding)          (None, 50, 5)         500                                          
____________________________________________________________________________________________________
concatenate_1 (Concatenate)      (None, 50, 55)        0                                            
____________________________________________________________________________________________________
conv1d_1 (Conv1D)                (None, 46, 300)       82800                                        
____________________________________________________________________________________________________
global_max_pooling1d_1 (GlobalMa (None, 300)           0                                            
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 300)           90300                                        
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 300)           0                                            
____________________________________________________________________________________________________
dense_2 (Dense)                  (None, 11)            3311                                         
____________________________________________________________________________________________________
softmax_layer (Activation)       (None, 11)            0                                            
====================================================================================================
Total params: 3,024,261.0
Trainable params: 3,024,261.0
Non-trainable params: 0.0
____________________________________________________________________________________________________
Entrenando...
Train on 365080 samples, validate on 78577 samples
Epoch 1/20
164s - loss: 0.3499 - acc: 0.8857 - val_loss: 1.1087 - val_acc: 0.7151
Epoch 2/20
163s - loss: 0.1066 - acc: 0.9649 - val_loss: 1.4029 - val_acc: 0.7019
Epoch 3/20
163s - loss: 0.0594 - acc: 0.9805 - val_loss: 1.6363 - val_acc: 0.6946
Epoch 4/20
163s - loss: 0.0369 - acc: 0.9879 - val_loss: 1.9029 - val_acc: 0.6885
Epoch 5/20
163s - loss: 0.0270 - acc: 0.9910 - val_loss: 2.0965 - val_acc: 0.6831
Obteniendo metricas...
