Cargando casos de entrenamiento...
[0 0 0 0 0 0 0 0 0 0 1]
Cargando casos de prueba...
[1 0 0 0 0 0 0 0 0 0 0]
Compilando red...
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
main_input (InputLayer)          (None, 50)            0                                            
____________________________________________________________________________________________________
aux_input (InputLayer)           (None, 50)            0                                            
____________________________________________________________________________________________________
embedding_2 (Embedding)          (None, 50, 50)        2847350                                      
____________________________________________________________________________________________________
embedding_1 (Embedding)          (None, 50, 5)         500                                          
____________________________________________________________________________________________________
concatenate_1 (Concatenate)      (None, 50, 55)        0                                            
____________________________________________________________________________________________________
conv1d_1 (Conv1D)                (None, 46, 300)       82800                                        
____________________________________________________________________________________________________
global_max_pooling1d_1 (GlobalMa (None, 300)           0                                            
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 300)           90300                                        
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 300)           0                                            
____________________________________________________________________________________________________
dense_2 (Dense)                  (None, 11)            3311                                         
____________________________________________________________________________________________________
softmax_layer (Activation)       (None, 11)            0                                            
====================================================================================================
Total params: 3,024,261.0
Trainable params: 3,024,261.0
Non-trainable params: 0.0
____________________________________________________________________________________________________
Entrenando...
Train on 364880 samples, validate on 78535 samples
Epoch 1/20
164s - loss: 0.4731 - acc: 0.8418 - val_loss: 0.3999 - val_acc: 0.8656
Epoch 2/20
163s - loss: 0.1953 - acc: 0.9343 - val_loss: 0.4446 - val_acc: 0.8653
Epoch 3/20
163s - loss: 0.1083 - acc: 0.9634 - val_loss: 0.5577 - val_acc: 0.8623
Epoch 4/20
163s - loss: 0.0674 - acc: 0.9770 - val_loss: 0.6450 - val_acc: 0.8593
Epoch 5/20
163s - loss: 0.0457 - acc: 0.9843 - val_loss: 0.7374 - val_acc: 0.8565
Obteniendo metricas...
