Cantidad de palabras consideradas: 56947
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
main_input (InputLayer)          (None, None)          0                                            
____________________________________________________________________________________________________
embedding_1 (Embedding)          (None, None, 150)     8542050                                      
____________________________________________________________________________________________________
aux_input (InputLayer)           (None, None, 2)       0                                            
____________________________________________________________________________________________________
concatenate_1 (Concatenate)      (None, None, 152)     0                                            
____________________________________________________________________________________________________
conv1d_1 (Conv1D)                (None, None, 300)     228300                                       
____________________________________________________________________________________________________
global_max_pooling1d_1 (GlobalMa (None, 300)           0                                            
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 300)           90300                                        
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 300)           0                                            
____________________________________________________________________________________________________
dense_2 (Dense)                  (None, 33)            9933                                         
____________________________________________________________________________________________________
softmax_layer (Activation)       (None, 33)            0                                            
====================================================================================================
Total params: 8,870,583.0
Trainable params: 8,870,583.0
Non-trainable params: 0.0
____________________________________________________________________________________________________
Cargando casos de entrenamiento...
Cargando casos de prueba...
Entrenando...
Train on 1727336 samples, validate on 368226 samples
Epoch 1/3
1240s - loss: 0.9741 - acc: 0.7912 - val_loss: 0.9621 - val_acc: 0.7928
Epoch 2/3
1238s - loss: 0.9577 - acc: 0.7914 - val_loss: 0.9614 - val_acc: 0.7927
Epoch 3/3
1239s - loss: 0.9540 - acc: 0.7915 - val_loss: 0.9645 - val_acc: 0.7884
