Cargando casos de prueba...
Compilando red...
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_1 (Embedding)      (None, 11, 50)            2847350   
_________________________________________________________________
flatten_1 (Flatten)          (None, 550)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 300)               165300    
_________________________________________________________________
activation_1 (Activation)    (None, 300)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 299)               89999     
_________________________________________________________________
activation_2 (Activation)    (None, 299)               0         
=================================================================
Total params: 3,102,649.0
Trainable params: 3,102,649.0
Non-trainable params: 0.0
_________________________________________________________________
Obteniendo metricas...
