Cargando casos de entrenamiento...
Cargando casos de prueba...
Compilando red...
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
aux_input (InputLayer)           (None, 50)            0                                            
____________________________________________________________________________________________________
aux_input2 (InputLayer)          (None, 50)            0                                            
____________________________________________________________________________________________________
main_input (InputLayer)          (None, 50)            0                                            
____________________________________________________________________________________________________
embedding_1 (Embedding)          (None, 50, 5)         500                                          
____________________________________________________________________________________________________
embedding_2 (Embedding)          (None, 50, 5)         500                                          
____________________________________________________________________________________________________
embedding_3 (Embedding)          (None, 50, 50)        2847350                                      
____________________________________________________________________________________________________
concatenate_1 (Concatenate)      (None, 50, 10)        0                                            
____________________________________________________________________________________________________
concatenate_2 (Concatenate)      (None, 50, 60)        0                                            
____________________________________________________________________________________________________
conv1d_1 (Conv1D)                (None, 46, 300)       90300                                        
____________________________________________________________________________________________________
global_max_pooling1d_1 (GlobalMa (None, 300)           0                                            
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 300)           90300                                        
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 300)           0                                            
____________________________________________________________________________________________________
dense_2 (Dense)                  (None, 51)            15351                                        
____________________________________________________________________________________________________
softmax_layer (Activation)       (None, 51)            0                                            
====================================================================================================
Total params: 3,044,301.0
Trainable params: 3,044,301.0
Non-trainable params: 0.0
____________________________________________________________________________________________________
Entrenando...
Train on 365720 samples, validate on 78706 samples
Epoch 1/3
174s - loss: 4013123.1310 - acc: 0.1086 - val_loss: 4279329.8071 - val_acc: 0.0350
Epoch 2/3
174s - loss: 3952999.3301 - acc: 0.1393 - val_loss: 4285018.8860 - val_acc: 0.0373
Epoch 3/3
174s - loss: 3948605.4773 - acc: 0.1476 - val_loss: 4282351.0569 - val_acc: 0.0442
Obteniendo metricas...
