Cargando casos de entrenamiento...
[0 0 1 0 0 0 0 0 0 0 0 0]
Cargando casos de prueba...
[0 0 0 0 0 1 0 0 0 0 0 0]
Compilando red...
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
main_input (InputLayer)          (None, 50)            0                                            
____________________________________________________________________________________________________
aux_input (InputLayer)           (None, 50)            0                                            
____________________________________________________________________________________________________
embedding_2 (Embedding)          (None, 50, 50)        2847350                                      
____________________________________________________________________________________________________
embedding_1 (Embedding)          (None, 50, 5)         500                                          
____________________________________________________________________________________________________
concatenate_1 (Concatenate)      (None, 50, 55)        0                                            
____________________________________________________________________________________________________
conv1d_1 (Conv1D)                (None, 46, 300)       82800                                        
____________________________________________________________________________________________________
global_max_pooling1d_1 (GlobalMa (None, 300)           0                                            
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 300)           90300                                        
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 300)           0                                            
____________________________________________________________________________________________________
dense_2 (Dense)                  (None, 12)            3612                                         
____________________________________________________________________________________________________
softmax_layer (Activation)       (None, 12)            0                                            
====================================================================================================
Total params: 3,024,562.0
Trainable params: 3,024,562.0
Non-trainable params: 0.0
____________________________________________________________________________________________________
Entrenando...
Train on 365720 samples, validate on 78706 samples
Epoch 1/3
164s - loss: 0.2200 - acc: 0.9282 - val_loss: 0.1254 - val_acc: 0.9590
Epoch 2/3
164s - loss: 0.0698 - acc: 0.9772 - val_loss: 0.1263 - val_acc: 0.9598
Epoch 3/3
164s - loss: 0.0370 - acc: 0.9879 - val_loss: 0.1328 - val_acc: 0.9625
Obteniendo metricas...
