Cargando casos de entrenamiento...
[1 0 0 0 0 0 0 0 0 0 0]
Cargando casos de prueba...
[1 0 0 0 0 0 0 0 0 0 0]
Compilando red...
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
main_input (InputLayer)          (None, 50)            0                                            
____________________________________________________________________________________________________
aux_input (InputLayer)           (None, 50)            0                                            
____________________________________________________________________________________________________
embedding_2 (Embedding)          (None, 50, 50)        2847350                                      
____________________________________________________________________________________________________
embedding_1 (Embedding)          (None, 50, 5)         500                                          
____________________________________________________________________________________________________
concatenate_1 (Concatenate)      (None, 50, 55)        0                                            
____________________________________________________________________________________________________
conv1d_1 (Conv1D)                (None, 46, 300)       82800                                        
____________________________________________________________________________________________________
global_max_pooling1d_1 (GlobalMa (None, 300)           0                                            
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 300)           90300                                        
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 300)           0                                            
____________________________________________________________________________________________________
dense_2 (Dense)                  (None, 11)            3311                                         
____________________________________________________________________________________________________
softmax_layer (Activation)       (None, 11)            0                                            
====================================================================================================
Total params: 3,024,261.0
Trainable params: 3,024,261.0
Non-trainable params: 0.0
____________________________________________________________________________________________________
Entrenando...
Train on 60798 samples, validate on 78577 samples
Epoch 1/20
40s - loss: 0.6466 - acc: 0.7975 - val_loss: 1.3525 - val_acc: 0.6197
Epoch 2/20
40s - loss: 0.1806 - acc: 0.9423 - val_loss: 1.7591 - val_acc: 0.5968
Epoch 3/20
40s - loss: 0.0679 - acc: 0.9780 - val_loss: 2.1306 - val_acc: 0.5998
Epoch 4/20
40s - loss: 0.0328 - acc: 0.9902 - val_loss: 2.4116 - val_acc: 0.5968
Epoch 5/20
40s - loss: 0.0196 - acc: 0.9943 - val_loss: 2.6232 - val_acc: 0.5839
Obteniendo metricas...
