Cargando casos de entrenamiento...
[0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1]
Cargando casos de prueba...
[1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0]
Compilando red...
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
aux_input (InputLayer)           (None, 50)            0                                            
____________________________________________________________________________________________________
aux_input2 (InputLayer)          (None, 50)            0                                            
____________________________________________________________________________________________________
main_input (InputLayer)          (None, 50)            0                                            
____________________________________________________________________________________________________
embedding_1 (Embedding)          (None, 50, 5)         500                                          
____________________________________________________________________________________________________
embedding_2 (Embedding)          (None, 50, 5)         500                                          
____________________________________________________________________________________________________
embedding_3 (Embedding)          (None, 50, 50)        2847350                                      
____________________________________________________________________________________________________
concatenate_1 (Concatenate)      (None, 50, 10)        0                                            
____________________________________________________________________________________________________
concatenate_2 (Concatenate)      (None, 50, 60)        0                                            
____________________________________________________________________________________________________
conv1d_1 (Conv1D)                (None, 46, 300)       90300                                        
____________________________________________________________________________________________________
global_max_pooling1d_1 (GlobalMa (None, 300)           0                                            
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 300)           90300                                        
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 300)           0                                            
____________________________________________________________________________________________________
dense_2 (Dense)                  (None, 500)           150500                                       
____________________________________________________________________________________________________
activation_2 (Activation)        (None, 500)           0                                            
____________________________________________________________________________________________________
dense_3 (Dense)                  (None, 17)            8517                                         
____________________________________________________________________________________________________
softmax_layer (Activation)       (None, 17)            0                                            
====================================================================================================
Total params: 3,187,967.0
Trainable params: 3,187,967.0
Non-trainable params: 0.0
____________________________________________________________________________________________________
Entrenando...
Train on 1727336 samples, validate on 368226 samples
Epoch 1/20
832s - loss: 0.3003 - acc: 0.9056 - val_loss: 0.6546 - val_acc: 0.8472
Epoch 2/20
830s - loss: 0.1351 - acc: 0.9564 - val_loss: 0.7127 - val_acc: 0.8468
Epoch 3/20
830s - loss: 0.0953 - acc: 0.9692 - val_loss: 0.8282 - val_acc: 0.8354
Epoch 4/20
830s - loss: 0.0762 - acc: 0.9754 - val_loss: 0.8921 - val_acc: 0.8426
Epoch 5/20
830s - loss: 0.0650 - acc: 0.9789 - val_loss: 0.9329 - val_acc: 0.8427
Obteniendo metricas...
