Cantidad de palabras consideradas: 56947
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
main_input (InputLayer)          (None, None)          0                                            
____________________________________________________________________________________________________
embedding_1 (Embedding)          (None, None, 150)     8542050                                      
____________________________________________________________________________________________________
aux_input (InputLayer)           (None, None, 1)       0                                            
____________________________________________________________________________________________________
concatenate_1 (Concatenate)      (None, None, 151)     0                                            
____________________________________________________________________________________________________
conv1d_1 (Conv1D)                (None, None, 300)     226800                                       
____________________________________________________________________________________________________
global_max_pooling1d_1 (GlobalMa (None, 300)           0                                            
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 300)           90300                                        
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 300)           0                                            
____________________________________________________________________________________________________
dense_2 (Dense)                  (None, 643)           193543                                       
____________________________________________________________________________________________________
softmax_layer (Activation)       (None, 643)           0                                            
====================================================================================================
Total params: 9,052,693.0
Trainable params: 9,052,693.0
Non-trainable params: 0.0
____________________________________________________________________________________________________
Cargando casos de entrenamiento...
Cargando casos de prueba...
Entrenando...
Train on 192741 samples, validate on 42171 samples
Epoch 1/3
113s - loss: 2.6250 - acc: 0.2455 - val_loss: 2.5810 - val_acc: 0.2546
Epoch 2/3
112s - loss: 2.6089 - acc: 0.2458 - val_loss: 2.5932 - val_acc: 0.2545
Epoch 3/3
112s - loss: 2.6087 - acc: 0.2429 - val_loss: 2.5977 - val_acc: 0.2546
