Cargando casos de entrenamiento...
[1 0 0 0 0 0 0 0 0 0 0]
Cargando casos de prueba...
[1 0 0 0 0 0 0 0 0 0 0]
Compilando red...
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
main_input (InputLayer)          (None, 50)            0                                            
____________________________________________________________________________________________________
aux_input (InputLayer)           (None, 50)            0                                            
____________________________________________________________________________________________________
embedding_2 (Embedding)          (None, 50, 50)        2847350                                      
____________________________________________________________________________________________________
embedding_1 (Embedding)          (None, 50, 5)         500                                          
____________________________________________________________________________________________________
concatenate_1 (Concatenate)      (None, 50, 55)        0                                            
____________________________________________________________________________________________________
conv1d_1 (Conv1D)                (None, 46, 300)       82800                                        
____________________________________________________________________________________________________
global_max_pooling1d_1 (GlobalMa (None, 300)           0                                            
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 300)           90300                                        
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 300)           0                                            
____________________________________________________________________________________________________
dense_2 (Dense)                  (None, 11)            3311                                         
____________________________________________________________________________________________________
softmax_layer (Activation)       (None, 11)            0                                            
====================================================================================================
Total params: 3,024,261.0
Trainable params: 3,024,261.0
Non-trainable params: 0.0
____________________________________________________________________________________________________
Entrenando...
Train on 365080 samples, validate on 78577 samples
Epoch 1/3
167s - loss: 0.3514 - acc: 0.8851 - val_loss: 1.1219 - val_acc: 0.7098
Epoch 2/3
165s - loss: 0.1079 - acc: 0.9643 - val_loss: 1.4537 - val_acc: 0.6953
Epoch 3/3
164s - loss: 0.0598 - acc: 0.9802 - val_loss: 1.5571 - val_acc: 0.7030
Obteniendo metricas...
