Cantidad de palabras consideradas: 55590
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
main_input (InputLayer)          (None, None)          0                                            
____________________________________________________________________________________________________
embedding_1 (Embedding)          (None, None, 50)      2779500                                      
____________________________________________________________________________________________________
conv1d_1 (Conv1D)                (None, None, 300)     75300                                        
____________________________________________________________________________________________________
global_max_pooling1d_1 (GlobalMa (None, 300)           0                                            
____________________________________________________________________________________________________
aux_input (InputLayer)           (None, 150)           0                                            
____________________________________________________________________________________________________
concatenate_1 (Concatenate)      (None, 450)           0                                            
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 300)           135300                                       
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 300)           0                                            
____________________________________________________________________________________________________
dense_2 (Dense)                  (None, 16)            4816                                         
____________________________________________________________________________________________________
activation_2 (Activation)        (None, 16)            0                                            
====================================================================================================
Total params: 2,994,916.0
Trainable params: 2,994,916.0
Non-trainable params: 0.0
____________________________________________________________________________________________________
Cargando casos de entrenamiento...
Cargando casos de prueba...
Entrenando...
