Cantidad de palabras consideradas: 56947
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
main_input (InputLayer)          (None, None)          0                                            
____________________________________________________________________________________________________
embedding_1 (Embedding)          (None, None, 50)      2847350                                      
____________________________________________________________________________________________________
aux_input (InputLayer)           (None, None, 1)       0                                            
____________________________________________________________________________________________________
concatenate_1 (Concatenate)      (None, None, 51)      0                                            
____________________________________________________________________________________________________
conv1d_1 (Conv1D)                (None, None, 300)     76800                                        
____________________________________________________________________________________________________
global_max_pooling1d_1 (GlobalMa (None, 300)           0                                            
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 300)           90300                                        
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 300)           0                                            
____________________________________________________________________________________________________
dense_2 (Dense)                  (None, 643)           193543                                       
____________________________________________________________________________________________________
softmax_layer (Activation)       (None, 643)           0                                            
====================================================================================================
Total params: 3,207,993.0
Trainable params: 3,207,993.0
Non-trainable params: 0.0
____________________________________________________________________________________________________
Cargando casos de entrenamiento...
Cargando casos de prueba...
Entrenando...
Train on 192741 samples, validate on 42171 samples
Epoch 1/3
46s - loss: 2.6287 - acc: 0.2435 - val_loss: 2.6347 - val_acc: 0.2546
Epoch 2/3
45s - loss: 2.6117 - acc: 0.2441 - val_loss: 2.6277 - val_acc: 0.2546
Epoch 3/3
45s - loss: 2.6103 - acc: 0.2456 - val_loss: 2.6017 - val_acc: 0.2546
